cf_billing/Documents/бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестПочасовыеЗначенияНерегулируемойЦены</xr:Item>
				<xr:Item>InformationRegister.бестЗначенияНерегулируемойЦены</xr:Item>
				<xr:Item>InformationRegister.бестЗначенияНерегулируемойЦеныНаМощность</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЗначенияНерегулируемойЦены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяКатегория</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПочасовыеЗначения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>День</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Час</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазрезыПочасовыхЗначений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяКатегория</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЦены</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестТипыЦенНаЭЭ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>IDСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЦеныНаМощность</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЦеноваяКатегория</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/InformationRegisters/бестЗначенияНерегулируемойЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестЗначенияНерегулируемойЦены</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТарифнаяЗона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестПочасовыеЗначенияНерегулируемойЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПочасовыеЗначенияНерегулируемойЦены</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестТипыЦенНаЭЭ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>День</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Час</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестЗначенияНерегулируемойЦеныНаМощность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестЗначенияНерегулируемойЦеныНаМощность</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеноваяКатегория</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестЦеновыеКатегории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКонтрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Documents/бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
	ДатыЗапретаИзменения.ПроверитьДатуЗапретаИзмененияПередЗаписьюДокумента(ЭтотОбъект,Отказ,РежимЗаписи,РежимПроведения);
	
	Ответственный 				= Пользователи.ТекущийПользователь();		  
	
	бестПроведениеСерверНП.ПередЗаписьюОбъекта(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	бестПроведениеСерверНП.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Пакет = ПолучитьДанныеДляПроведения();
	
	ДанныеЗначенияНерегулируемойЦены			= Пакет[1];
	ДанныеПочасовыеЗначенияНерегулируемойЦены	= Пакет[2];
	ДанныеЗначенияНерегулируемойЦеныНаМощность	= Пакет[3];

	
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеЗначенияНерегулируемойЦены,				Движения.бестЗначенияНерегулируемойЦены);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеПочасовыеЗначенияНерегулируемойЦены,		Движения.бестПочасовыеЗначенияНерегулируемойЦены);
	бестПроведениеСерверНП.ВыполнитьДвиженияПоРезультатуЗапроса(ДанныеЗначенияНерегулируемойЦеныНаМощность,		Движения.бестЗначенияНерегулируемойЦеныНаМощность);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеДляПроведения()
	Запрос  	= Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	
	Текст 		= "ВЫБРАТЬ
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.Ссылка КАК Ссылка,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.Организация КАК Организация,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.ПериодНачисления КАК ПериодНачисления,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.Район КАК Район
	      		  |ПОМЕСТИТЬ Шапка
	      		  |ИЗ
	      		  |	Документ.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены КАК бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены
	      		  |ГДЕ
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.Ссылка = &Ссылка
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	Шапка.Организация КАК Организация,
	      		  |	Шапка.ПериодНачисления КАК ПериодНачисления,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены.ЦеноваяКатегория КАК ЦеноваяКатегория,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены.Поставщик КАК Поставщик,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены.Услуга КАК Услуга,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены.ТарифнаяЗона КАК ТарифнаяЗона,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены.Значение КАК Значение,
	      		  |	Шапка.Район КАК Район
	      		  |ИЗ
	      		  |	Шапка КАК Шапка
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.ЗначенияНерегулируемойЦены КАК бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены
	      		  |		ПО Шапка.Ссылка = бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЗначенияНерегулируемойЦены.Ссылка
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	Шапка.Организация КАК Организация,
	      		  |	Шапка.ПериодНачисления КАК ПериодНачисления,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.ЦеноваяКатегория КАК ЦеноваяКатегория,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.ТипЦены КАК ТипЦены,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.Поставщик КАК Поставщик,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.Услуга КАК Услуга,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныПочасовыеЗначения.День КАК День,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныПочасовыеЗначения.Час КАК Час,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныПочасовыеЗначения.Значение КАК Значение,
	      		  |	Шапка.Район КАК Район
	      		  |ИЗ
	      		  |	Шапка КАК Шапка
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.РазрезыПочасовыхЗначений КАК бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений
	      		  |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.ПочасовыеЗначения КАК бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныПочасовыеЗначения
	      		  |			ПО (бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныПочасовыеЗначения.Ссылка = бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.Ссылка)
	      		  |				И (бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныПочасовыеЗначения.IDСтроки = бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.IDСтроки)
	      		  |		ПО Шапка.Ссылка = бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныРазрезыПочасовыхЗначений.Ссылка
	      		  |;
	      		  |
	      		  |////////////////////////////////////////////////////////////////////////////////
	      		  |ВЫБРАТЬ
	      		  |	Шапка.Организация КАК Организация,
	      		  |	Шапка.ПериодНачисления КАК ПериодНачисления,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЦеныНаМощность.ЦеноваяКатегория КАК ЦеноваяКатегория,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЦеныНаМощность.Поставщик КАК Поставщик,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЦеныНаМощность.Услуга КАК Услуга,
	      		  |	бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЦеныНаМощность.Значение КАК Значение,
	      		  |	Шапка.Район КАК Район
	      		  |ИЗ
	      		  |	Шапка КАК Шапка
	      		  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦены.ЦеныНаМощность КАК бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЦеныНаМощность
	      		  |		ПО Шапка.Ссылка = бестИзменитьЗначениеСредневзвешеннойНерегулируемойЦеныЦеныНаМощность.Ссылка";
	
	Запрос.Текст = Текст;
	
	Возврат Запрос.ВыполнитьПакетСПромежуточнымиДанными(); 
КонецФункции

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
